iteration on a dataframe can be done in 2 ways
Row Iteration => three predefined functions which can be used as :
        iterrows()
        iteritems()
        itertuples()
Column Iteration
    First Create a list of dataframe columns and then
    iterating it through it to see dataframe columns

In [1]:
import pandas as pd
import numpy as np

In [3]:
dataframe = pd.DataFrame()
print(dataframe)

Empty DataFrame
Columns: []
Index: []

# Rows Iteration

In [4]:
data = [['Mukesh',10],['Rahul',12],['Akash',13]]
dataframe = pd.DataFrame(data=data,columns=['Name','Age'])
dataframe

     Name  Age
0  Mukesh   10
1   Rahul   12
2   Akash   13

In [5]:
data = [['Mukesh',10],['Rahul',12],['Akash',13]]
dataframe = pd.DataFrame(data=data,columns=['Name','Age'],dtype=float)
dataframe

     Name   Age
0  Mukesh  10.0
1   Rahul  12.0
2   Akash  13.0

In [6]:
data = [['Mukesh',10],['Rahul',12],['Akash',13]]
dataframe = pd.DataFrame(data=data,columns=['Name','Age'],dtype=float,index=[1,2,3])
dataframe

     Name   Age
1  Mukesh  10.0
2   Rahul  12.0
3   Akash  13.0

In [7]:
dict_ = {'name': ['mukesh','Rahul','Akash','Ohm'],
        'total_marks':[80,40,60,90],
        'age':[22,24,21,28],
        'team':['A','B','C','D'],
        'college':['XZ','ZZ','ZX','XZX']}

In [8]:
dataframe = pd.DataFrame(dict_)
dataframe

     name  total_marks  age team college
0  mukesh           80   22    A      XZ
1   Rahul           40   24    B      ZZ
2   Akash           60   21    C      ZX
3     Ohm           90   28    D     XZX

In [9]:
#accessing rows usingindex
for index in dataframe.index:
    print(dataframe['name'][index], dataframe['age'][index])

mukesh 22
Rahul 24
Akash 21
Ohm 28

In [10]:
dataframe['name']

0    mukesh
1     Rahul
2     Akash
3       Ohm
Name: name, dtype: object

In [11]:
dataframe['age']

0    22
1    24
2    21
3    28
Name: age, dtype: int64

In [12]:
# assesing rows using loc
for index in range(len(dataframe)):
    print(dataframe.loc[index,'name'],dataframe.loc[index,'age'])

mukesh 22
Rahul 24
Akash 21
Ohm 28

In [13]:
# assesing rows using iloc
for index in range(len(dataframe)):
    print(dataframe.iloc[index,0],dataframe.iloc[index,1])

mukesh 80
Rahul 40
Akash 60
Ohm 90

# apply() method

In [15]:
dataframe.apply(lambda row: row['name'] + " "+ str(row['age']),axis=1)

0    mukesh 22
1     Rahul 24
2     Akash 21
3       Ohm 28
dtype: object

In [16]:
dataframe

     name  total_marks  age team college
0  mukesh           80   22    A      XZ
1   Rahul           40   24    B      ZZ
2   Akash           60   21    C      ZX
3     Ohm           90   28    D     XZX

In [17]:
#iteration over rows
for index_or_row,data_at_index_or_row in dataframe.iterrows():
    print(index_or_row,'\n',data_at_index_or_row,'\n','***'*10)

0
 name           mukesh
total_marks        80
age                22
team                A
college            XZ
Name: 0, dtype: object
 ******************************
1
 name           Rahul
total_marks       40
age               24
team               B
college           ZZ
Name: 1, dtype: object
 ******************************
2
 name           Akash
total_marks       60
age               21
team               C
college           ZX
Name: 2, dtype: object
 ******************************
3
 name           Ohm
total_marks     90
age             28
team             D
college        XZX
Name: 3, dtype: object
 ******************************

In [19]:
for column_name,column_data in dataframe.iteritems():
    print(column_name)

name
total_marks
age
team
college

In [20]:
for column_name,column_data in dataframe.iteritems():
    print(column_data)

0    mukesh
1     Rahul
2     Akash
3       Ohm
Name: name, dtype: object
0    80
1    40
2    60
3    90
Name: total_marks, dtype: int64
0    22
1    24
2    21
3    28
Name: age, dtype: int64
0    A
1    B
2    C
3    D
Name: team, dtype: object
0     XZ
1     ZZ
2     ZX
3    XZX
Name: college, dtype: object

In [21]:
for i in dataframe.itertuples():
    print(i)

Pandas(Index=0, name='mukesh', total_marks=80, age=22, team='A', college='XZ')
Pandas(Index=1, name='Rahul', total_marks=40, age=24, team='B', college='ZZ')
Pandas(Index=2, name='Akash', total_marks=60, age=21, team='C', college='ZX')
Pandas(Index=3, name='Ohm', total_marks=90, age=28, team='D', college='XZX')

# column Iteration

concept is :
    create a list of dataframe columns => all columns list
    then iterating through that list to pull out dataframe columns

In [22]:
columns_name_list = list(dataframe)
columns_name_list

['name', 'total_marks', 'age', 'team', 'college']

In [23]:
for column_name in columns_name_list:
    print(dataframe[column_name])

0    mukesh
1     Rahul
2     Akash
3       Ohm
Name: name, dtype: object
0    80
1    40
2    60
3    90
Name: total_marks, dtype: int64
0    22
1    24
2    21
3    28
Name: age, dtype: int64
0    A
1    B
2    C
3    D
Name: team, dtype: object
0     XZ
1     ZZ
2     ZX
3    XZX
Name: college, dtype: object

In [24]:
for column_name in columns_name_list:
    print(dataframe[column_name][2])

Akash
60
21
C
ZX